MATTMCCA/STM32L071KB-Breakout/Code/Post_Build_GPIO_Test/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define PIN_PC14_Pin GPIO_PIN_14
#define PIN_PC14_GPIO_Port GPIOC
#define PIN_PC15_Pin GPIO_PIN_15
#define PIN_PC15_GPIO_Port GPIOC
#define PIN_PA0_Pin GPIO_PIN_0
#define PIN_PA0_GPIO_Port GPIOA
#define PIN_PA1_Pin GPIO_PIN_1
#define PIN_PA1_GPIO_Port GPIOA
#define PIN_PA2_Pin GPIO_PIN_2
#define PIN_PA2_GPIO_Port GPIOA
#define PIN_PA3_Pin GPIO_PIN_3
#define PIN_PA3_GPIO_Port GPIOA
#define PIN_PA4_Pin GPIO_PIN_4
#define PIN_PA4_GPIO_Port GPIOA
#define PIN_PA5_Pin GPIO_PIN_5
#define PIN_PA5_GPIO_Port GPIOA
#define PIN_PA6_Pin GPIO_PIN_6
#define PIN_PA6_GPIO_Port GPIOA
#define PIN_PA7_Pin GPIO_PIN_7
#define PIN_PA7_GPIO_Port GPIOA
#define PIN_PB0_Pin GPIO_PIN_0
#define PIN_PB0_GPIO_Port GPIOB
#define PIN_PB1_Pin GPIO_PIN_1
#define PIN_PB1_GPIO_Port GPIOB
#define PIN_PA8_Pin GPIO_PIN_8
#define PIN_PA8_GPIO_Port GPIOA
#define PIN_PA9_Pin GPIO_PIN_9
#define PIN_PA9_GPIO_Port GPIOA
#define PIN_PA10_Pin GPIO_PIN_10
#define PIN_PA10_GPIO_Port GPIOA
#define PIN_PA11_Pin GPIO_PIN_11
#define PIN_PA11_GPIO_Port GPIOA
#define PIN_PA12_Pin GPIO_PIN_12
#define PIN_PA12_GPIO_Port GPIOA
#define PIN_PA15_Pin GPIO_PIN_15
#define PIN_PA15_GPIO_Port GPIOA
#define PIN_PB3_Pin GPIO_PIN_3
#define PIN_PB3_GPIO_Port GPIOB
#define PIN_PB4_Pin GPIO_PIN_4
#define PIN_PB4_GPIO_Port GPIOB
#define PIN_PB5_Pin GPIO_PIN_5
#define PIN_PB5_GPIO_Port GPIOB
#define PIN_PB6_Pin GPIO_PIN_6
#define PIN_PB6_GPIO_Port GPIOB
#define PIN_PB7_Pin GPIO_PIN_7
#define PIN_PB7_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
